'''Использовал для заполнения данных годовой добычи и экономических показателей 
(налог, себестоимость и т.д.) годофой отчетной формы в Департамент.
Ввести общие константы для первого карьера. Далее для каждого года только в Body: '''
KR = 1.18     # коэффициент разрыхления ПИ
PP = 17.7     # плановый процент потерь ПИ

'''----------------------------------объявление ф-ий и классов------------------------------------'''
class GD:
    '''Годовая добыча:
       вводим данные  ежемесячных таблиц Департамента'''
    z = print
    def __init__(self, month, vol_razryhl, stoim, sebest, nalog, kr = KR): 
        self.m , self.vr, self.stoim, self.sebest, self.nalog, self. kr, self.vp = \
        month, vol_razryhl, stoim, sebest, nalog, kr, round( vol_razryhl / kr, 3)
    def __repr__(self):
        '''a - Возвращает все значения аттрибутов экземпляра '''
        z('месяц ','  стоим','   себестоим','     налог','извл_разрыхл','коэф_разр','извл_плотном', sep = ' ' * 4)
        dictionary = self.__dict__
        string = ''
        for _ in dictionary:
            string += str( dictionary[_] ) + ' '*13
        return string
    
'''--------------------------------------------------BODY--------------------------------------------'''
z = print
z('Обработка данных из месячных отчетов, все объемы в Тыс. Куб. м. : ')

listys =( 
#---------------------------2017----------------------------
[   ( 'jan', 0, 0, 0, 0 ),
    ( 'feb', 0, 0, 0, 0 ),
    ( 'mar', 0, 0, 0, 0 ),
    ( 'apr', 0, 0, 0, 0 ),
    ( 'may', 0, 0, 0, 0 ),
    ( 'jun', 0, 0, 0, 0 ),
    ( 'jul', 0, 0, 0, 0 ),
    ( 'aug', 0, 0, 0, 0 ),
    ( 'sep', 0, 0, 0, 0 ),
    ( 'oct', 0, 0, 0, 0 ),
    ( 'nov', 0, 0, 0, 0 ),
    ( 'dec', 0.932, 76.116, 81.67, 4.186)
],    
#----------------------------2018-----------------------------
[   ( 'jan', 0, 0, 0, 0, ),
    ( 'feb', 0, 0, 0, 0, ),
    ( 'mar', 0.478, 38.24, 304.88, 2.103),
    ( 'apr',  0, 0, 0, 0, ),
    ( 'may', 15.338, 1295.908, 67.35, 70.529),
    ( 'jun', 3.464, 381.04, 92.94, 20.957),
    ( 'jul', 2.750, 111.788, 61.56, 6.148), 
    ( 'aug', 15.164, 1170.054, 35.81, 64.353), 
    ( 'sep', 6.950, 647.881, 6.52, 35.633),
    ('oct', 0.1, 11.017, 453.18, 0.606),
    ( 'nov', 0, 0, 0, 0 ),
    ( 'dec', 0, 0, 0, 0 )
]  ) 

'''-----------------------------логика обработки---------------------'''

for num, listy in enumerate(listys):
    z('\nYear{1}{0}{1}'.format(2017+num, '-' * 35 ))
    year = [ GD(*_) for _ in listy  ]
    g1, g2, g3, g4, g5, g6, g7, g8, g9, g10, g11, g12 = year
    pp = PP; z('    Плановый процент потерь,  % = ', pp)
    ki = 100-pp; z('    Коэффициент извлечения, % = ', ki)
    z('    Коэффициент разрыхления ПИ = ', g1.kr)
    izvl_razr = sum( _.vr for _ in year) ; z('Объем извлек разрыхл =  ', izvl_razr)
    izvl_plot = sum( _.vp for _ in year) ; z('Объем извлек плотном =  ', izvl_plot)
    bal = round ( ( izvl_plot * 100 ) / ki, 3 ); z('Балансовые(разведанные) погашаемые = ', bal)
    pot = round( ( izvl_plot * pp ) / ki, 3 ); z('Потери = ', pot)
    bal_prov = round( (pot + izvl_plot), 3); z('Проверка Балансовых из суммы и Расчитанных:', bal_prov, ' = ', bal)
    stoimost = round( sum( _.stoim for _ in year), 5) ; z('Стоимость ПИ, тыс.руб.  =  ', stoimost)
    sebestoim = round( sum( _.sebest*_.vr for _ in year),5) ; z('Вся себестоимость всех кубов, тыс.руб.=  ', sebestoim)
    nalog = round(sum( _.nalog for _ in year),5) ; z('Начисленный налог, тыс. руб.   =  ', nalog)
    z('''                                   Форма 2-ЛС:
Раздел 4. Колонка 4, строка 13 (основное ПИ), в куб.м. = {}'''.format(bal * 1000))
    z('''Раздел 5.
                              № строки      Показ.в проекте(кол3)      Фактич. выполнен(кол 4)
Потери                      15                              {0}                                          {0}

Коэф. извлеч.            17                             {1}                                          {1}'''.format(pp,ki))
